In [2]:
import pandas as pd
pd

In [3]:
# Creating a DataFrame
data = {'Name': ['John', 'Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22, 35],
        'Salary': [50000, 60000, 55000, 70000]}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0     John   25   50000
1    Alice   30   60000
2      Bob   22   55000
3  Charlie   35   70000

In [4]:
sers = ['Donald', 20]
ser = pd.Series(sers, name="Add")
ser

0    Donald
1        20
Name: Add, dtype: object

In [5]:
young_employees = df[df['Age'] < 30]
young_employees

   Name  Age  Salary
0  John   25   50000
2   Bob   22   55000

In [6]:
young_high_earners = df[(df['Age'] < 30) & (df['Salary'] >= 55000)]
young_high_earners

  Name  Age  Salary
2  Bob   22   55000

In [7]:
selected_names = df[df['Name'].isin(['Alice', 'Charlie'])]
selected_names

      Name  Age  Salary
1    Alice   30   60000
3  Charlie   35   70000

In [8]:
a_names = df[df['Name'].str.startswith('A')]
a_names

    Name  Age  Salary
1  Alice   30   60000

In [11]:
non_null_salaries = df[df['Salary'].notnull()]
non_null_salaries

      Name  Age  Salary
0     John   25   50000
1    Alice   30   60000
2      Bob   22   55000
3  Charlie   35   70000